{
    "Mandatory Settings": [{
        
        "Section Description":[
            "Use these fields to cofigure settings required to test and train a model",

            "model                  : Classifier to usechosen from [KNeighborsClassifier,SVC,GradientBoostingClassifier,DecisionTreeClassifier,MLPClassifier,BaggingClassifier]",
            "frequency_features     : frequency of audio and features the model uses to train to test. Available models are located in the models folder",
            "emotions               : emotions to test/train, available for testing are [angry,happy,neutral,sad] ",
            "features               : Features to extract from audio, the number of features must equal the number specified in model_ver ",
            "Test or Train          : whether to test or train. If test, please configure Testing settings. If train, please configure Training settings"      
        ],   

        "model"                 :"MLPClassifier",
        "frequency_features"    :"16k_3feat_JL",
        "emotions"              :"angry,happy,neutral,sad",
        "features"              :"mfcc,chroma,mel",
        "Test or Train"         :"Test"
        
    }],

    "Test settings" : [{

        "Section description":[
        "Use these fields to cofigure your tessting setting",

        "Testing single will predict and print the emotion of a single audio file. To configure this:",
            "Test mode      : single",
                "Audio dierctory : the directory of the audio file to test",
        
        "Testing multiple will predict emotions from all audio in the directory predict_from_audio. The results are outputted to an excel or text file. To configure this:",
            "Test mode        : multiple",

                "Display predictions : how to output the predictions choose from:",
                                       "excel subset =  will predict a subset of the testing data and records it to an excel file; prediction.xlsx",
                                       "excel all    =  will predict all of the testing data in a specified folder and records it to an excel file; prediction.xlsx",
                                       "text         =  will predict a subset testing data  and records it to an text file; prection.txt",

                "Plot time taken     : yes or no, whether to plot time taken to predict and the length of the audio. Will be saved in the folder performance_plots"
        ],

        "Test mode" : "multiple",

        "Test single":[{
        "Audio directory": "predict_from_audio/Nene_16/happy_Nene.wav"
        }],
        
        "Test multiple":[{
            "Display predictions": "excel all",
            "Plot time taken": "Yes"
        }]

    }],

    "Train settings" : [{
        "Section description":[
            "Use these fields to cofigure your training setting",
            "Classifier to train: A list that contains the names (string0) of all the classifiers to train and display the confusion matrix. Choose from:",
                                  "KNeighborsClassifier, SVC, GradientBoostingClassifier, DecisionTreeClassifier, MLPClassifier, BaggingClassifier"
        ],
        "Classifiers to train": ["KNeighborsClassifier","SVC","GradientBoostingClassifier","DecisionTreeClassifier","MLPClassifier","BaggingClassifier"]


    }]

}